Revit 2027 API
BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolid Method
 Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ExecuteBooleanOperationModifyingOriginalSolid(
	Solid solid0,
	Solid solid1,
	BooleanOperationsType booleanType
)
Public Shared Sub ExecuteBooleanOperationModifyingOriginalSolid (
	solid0 As Solid,
	solid1 As Solid,
	booleanType As BooleanOperationsType
)
public:
static void ExecuteBooleanOperationModifyingOriginalSolid(
	Solid^ solid0,
	Solid^ solid1,
	BooleanOperationsType booleanType
)
static member ExecuteBooleanOperationModifyingOriginalSolid :
        solid0 : Solid *
        solid1 : Solid *
        booleanType : BooleanOperationsType -> unit
Parameters
solid0 Solid
 The original solid object. This object cannot be obtained directly from a Revit element. This means that IsElementGeometry cannot be true.
solid1 Solid
 The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType BooleanOperationsType
 boolean operation type.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the original solid object is the geometry of the Revit model.
ArgumentNullException |  A non-optional argument was NULL
InvalidOperationException |  Failed to perform the Boolean operation for the two solids. This may be due to geometric inaccuracies in the solids, such as slightly misaligned faces or edges. If so, eliminating the inaccuracies by making sure the solids are accurately aligned may solve the problem. This also may be due to one or both solids having complexities such as more than two faces geometrically meeting along a single edge, or two coincident edges, etc. Eliminating such conditions, or performing a sequence of Boolean operations in an order that avoids such conditions, may solve the problem."
Remarks
 This operation modifies the original input Geometry objects.
See Also
Reference
BooleanOperationsUtils Class
Autodesk.Revit.DB Namespace